HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEmem_bf.h
/**
 * \file IfxEmem_bf.h
 * \brief
 * \copyright Copyright (c) 2014 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC27XA_TS_V3.0.1.R2
 * Specification: TC27xA_TS_V3.0.1_SFR_OPEN_MARKET.xml (Revision: V3.0.1)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Emem_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxLld_Emem
 * 
 */
#ifndef IFXEMEM_BF_H
#define IFXEMEM_BF_H 1
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Emem_BitfieldsMask
 * \{  */

/** \\brief  Length for Ifx_EMEM_CLC_Bits.DISR */
#define IFX_EMEM_CLC_DISR_LEN (1)

/** \\brief  Mask for Ifx_EMEM_CLC_Bits.DISR */
#define IFX_EMEM_CLC_DISR_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_CLC_Bits.DISR */
#define IFX_EMEM_CLC_DISR_OFF (0)

/** \\brief  Length for Ifx_EMEM_CLC_Bits.DISS */
#define IFX_EMEM_CLC_DISS_LEN (1)

/** \\brief  Mask for Ifx_EMEM_CLC_Bits.DISS */
#define IFX_EMEM_CLC_DISS_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_CLC_Bits.DISS */
#define IFX_EMEM_CLC_DISS_OFF (1)

/** \\brief  Length for Ifx_EMEM_ID_Bits.MODNUMBER */
#define IFX_EMEM_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_EMEM_ID_Bits.MODNUMBER */
#define IFX_EMEM_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_EMEM_ID_Bits.MODNUMBER */
#define IFX_EMEM_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_EMEM_ID_Bits.MODREV */
#define IFX_EMEM_ID_MODREV_LEN (8)

/** \\brief  Mask for Ifx_EMEM_ID_Bits.MODREV */
#define IFX_EMEM_ID_MODREV_MSK (0xff)

/** \\brief  Offset for Ifx_EMEM_ID_Bits.MODREV */
#define IFX_EMEM_ID_MODREV_OFF (0)

/** \\brief  Length for Ifx_EMEM_ID_Bits.MODTYPE */
#define IFX_EMEM_ID_MODTYPE_LEN (8)

/** \\brief  Mask for Ifx_EMEM_ID_Bits.MODTYPE */
#define IFX_EMEM_ID_MODTYPE_MSK (0xff)

/** \\brief  Offset for Ifx_EMEM_ID_Bits.MODTYPE */
#define IFX_EMEM_ID_MODTYPE_OFF (8)

/** \\brief  Length for Ifx_EMEM_SBRCTR_Bits.ACGEN */
#define IFX_EMEM_SBRCTR_ACGEN_LEN (1)

/** \\brief  Mask for Ifx_EMEM_SBRCTR_Bits.ACGEN */
#define IFX_EMEM_SBRCTR_ACGEN_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_SBRCTR_Bits.ACGEN */
#define IFX_EMEM_SBRCTR_ACGEN_OFF (12)

/** \\brief  Length for Ifx_EMEM_SBRCTR_Bits.ACGST0 */
#define IFX_EMEM_SBRCTR_ACGST0_LEN (1)

/** \\brief  Mask for Ifx_EMEM_SBRCTR_Bits.ACGST0 */
#define IFX_EMEM_SBRCTR_ACGST0_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_SBRCTR_Bits.ACGST0 */
#define IFX_EMEM_SBRCTR_ACGST0_OFF (16)

/** \\brief  Length for Ifx_EMEM_SBRCTR_Bits.ACGST10 */
#define IFX_EMEM_SBRCTR_ACGST10_LEN (1)

/** \\brief  Mask for Ifx_EMEM_SBRCTR_Bits.ACGST10 */
#define IFX_EMEM_SBRCTR_ACGST10_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_SBRCTR_Bits.ACGST10 */
#define IFX_EMEM_SBRCTR_ACGST10_OFF (26)

/** \\brief  Length for Ifx_EMEM_SBRCTR_Bits.ACGST11 */
#define IFX_EMEM_SBRCTR_ACGST11_LEN (1)

/** \\brief  Mask for Ifx_EMEM_SBRCTR_Bits.ACGST11 */
#define IFX_EMEM_SBRCTR_ACGST11_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_SBRCTR_Bits.ACGST11 */
#define IFX_EMEM_SBRCTR_ACGST11_OFF (27)

/** \\brief  Length for Ifx_EMEM_SBRCTR_Bits.ACGST12 */
#define IFX_EMEM_SBRCTR_ACGST12_LEN (1)

/** \\brief  Mask for Ifx_EMEM_SBRCTR_Bits.ACGST12 */
#define IFX_EMEM_SBRCTR_ACGST12_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_SBRCTR_Bits.ACGST12 */
#define IFX_EMEM_SBRCTR_ACGST12_OFF (28)

/** \\brief  Length for Ifx_EMEM_SBRCTR_Bits.ACGST13 */
#define IFX_EMEM_SBRCTR_ACGST13_LEN (1)

/** \\brief  Mask for Ifx_EMEM_SBRCTR_Bits.ACGST13 */
#define IFX_EMEM_SBRCTR_ACGST13_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_SBRCTR_Bits.ACGST13 */
#define IFX_EMEM_SBRCTR_ACGST13_OFF (29)

/** \\brief  Length for Ifx_EMEM_SBRCTR_Bits.ACGST14 */
#define IFX_EMEM_SBRCTR_ACGST14_LEN (1)

/** \\brief  Mask for Ifx_EMEM_SBRCTR_Bits.ACGST14 */
#define IFX_EMEM_SBRCTR_ACGST14_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_SBRCTR_Bits.ACGST14 */
#define IFX_EMEM_SBRCTR_ACGST14_OFF (30)

/** \\brief  Length for Ifx_EMEM_SBRCTR_Bits.ACGST15 */
#define IFX_EMEM_SBRCTR_ACGST15_LEN (1)

/** \\brief  Mask for Ifx_EMEM_SBRCTR_Bits.ACGST15 */
#define IFX_EMEM_SBRCTR_ACGST15_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_SBRCTR_Bits.ACGST15 */
#define IFX_EMEM_SBRCTR_ACGST15_OFF (31)

/** \\brief  Length for Ifx_EMEM_SBRCTR_Bits.ACGST1 */
#define IFX_EMEM_SBRCTR_ACGST1_LEN (1)

/** \\brief  Mask for Ifx_EMEM_SBRCTR_Bits.ACGST1 */
#define IFX_EMEM_SBRCTR_ACGST1_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_SBRCTR_Bits.ACGST1 */
#define IFX_EMEM_SBRCTR_ACGST1_OFF (17)

/** \\brief  Length for Ifx_EMEM_SBRCTR_Bits.ACGST2 */
#define IFX_EMEM_SBRCTR_ACGST2_LEN (1)

/** \\brief  Mask for Ifx_EMEM_SBRCTR_Bits.ACGST2 */
#define IFX_EMEM_SBRCTR_ACGST2_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_SBRCTR_Bits.ACGST2 */
#define IFX_EMEM_SBRCTR_ACGST2_OFF (18)

/** \\brief  Length for Ifx_EMEM_SBRCTR_Bits.ACGST3 */
#define IFX_EMEM_SBRCTR_ACGST3_LEN (1)

/** \\brief  Mask for Ifx_EMEM_SBRCTR_Bits.ACGST3 */
#define IFX_EMEM_SBRCTR_ACGST3_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_SBRCTR_Bits.ACGST3 */
#define IFX_EMEM_SBRCTR_ACGST3_OFF (19)

/** \\brief  Length for Ifx_EMEM_SBRCTR_Bits.ACGST4 */
#define IFX_EMEM_SBRCTR_ACGST4_LEN (1)

/** \\brief  Mask for Ifx_EMEM_SBRCTR_Bits.ACGST4 */
#define IFX_EMEM_SBRCTR_ACGST4_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_SBRCTR_Bits.ACGST4 */
#define IFX_EMEM_SBRCTR_ACGST4_OFF (20)

/** \\brief  Length for Ifx_EMEM_SBRCTR_Bits.ACGST5 */
#define IFX_EMEM_SBRCTR_ACGST5_LEN (1)

