HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEmem_bf.h
/** \\brief  Mask for Ifx_EMEM_SBRCTR_Bits.ACGST5 */
#define IFX_EMEM_SBRCTR_ACGST5_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_SBRCTR_Bits.ACGST5 */
#define IFX_EMEM_SBRCTR_ACGST5_OFF (21)

/** \\brief  Length for Ifx_EMEM_SBRCTR_Bits.ACGST6 */
#define IFX_EMEM_SBRCTR_ACGST6_LEN (1)

/** \\brief  Mask for Ifx_EMEM_SBRCTR_Bits.ACGST6 */
#define IFX_EMEM_SBRCTR_ACGST6_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_SBRCTR_Bits.ACGST6 */
#define IFX_EMEM_SBRCTR_ACGST6_OFF (22)

/** \\brief  Length for Ifx_EMEM_SBRCTR_Bits.ACGST7 */
#define IFX_EMEM_SBRCTR_ACGST7_LEN (1)

/** \\brief  Mask for Ifx_EMEM_SBRCTR_Bits.ACGST7 */
#define IFX_EMEM_SBRCTR_ACGST7_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_SBRCTR_Bits.ACGST7 */
#define IFX_EMEM_SBRCTR_ACGST7_OFF (23)

/** \\brief  Length for Ifx_EMEM_SBRCTR_Bits.ACGST8 */
#define IFX_EMEM_SBRCTR_ACGST8_LEN (1)

/** \\brief  Mask for Ifx_EMEM_SBRCTR_Bits.ACGST8 */
#define IFX_EMEM_SBRCTR_ACGST8_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_SBRCTR_Bits.ACGST8 */
#define IFX_EMEM_SBRCTR_ACGST8_OFF (24)

/** \\brief  Length for Ifx_EMEM_SBRCTR_Bits.ACGST9 */
#define IFX_EMEM_SBRCTR_ACGST9_LEN (1)

/** \\brief  Mask for Ifx_EMEM_SBRCTR_Bits.ACGST9 */
#define IFX_EMEM_SBRCTR_ACGST9_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_SBRCTR_Bits.ACGST9 */
#define IFX_EMEM_SBRCTR_ACGST9_OFF (25)

/** \\brief  Length for Ifx_EMEM_SBRCTR_Bits.STBLOCK */
#define IFX_EMEM_SBRCTR_STBLOCK_LEN (1)

/** \\brief  Mask for Ifx_EMEM_SBRCTR_Bits.STBLOCK */
#define IFX_EMEM_SBRCTR_STBLOCK_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_SBRCTR_Bits.STBLOCK */
#define IFX_EMEM_SBRCTR_STBLOCK_OFF (0)

/** \\brief  Length for Ifx_EMEM_SBRCTR_Bits.STBSLK */
#define IFX_EMEM_SBRCTR_STBSLK_LEN (4)

/** \\brief  Mask for Ifx_EMEM_SBRCTR_Bits.STBSLK */
#define IFX_EMEM_SBRCTR_STBSLK_MSK (0xf)

/** \\brief  Offset for Ifx_EMEM_SBRCTR_Bits.STBSLK */
#define IFX_EMEM_SBRCTR_STBSLK_OFF (4)

/** \\brief  Length for Ifx_EMEM_SBRCTR_Bits.STBULK */
#define IFX_EMEM_SBRCTR_STBULK_LEN (3)

/** \\brief  Mask for Ifx_EMEM_SBRCTR_Bits.STBULK */
#define IFX_EMEM_SBRCTR_STBULK_MSK (0x7)

/** \\brief  Offset for Ifx_EMEM_SBRCTR_Bits.STBULK */
#define IFX_EMEM_SBRCTR_STBULK_OFF (1)

/** \\brief  Length for Ifx_EMEM_TILECC_Bits.T0 */
#define IFX_EMEM_TILECC_T0_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECC_Bits.T0 */
#define IFX_EMEM_TILECC_T0_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECC_Bits.T0 */
#define IFX_EMEM_TILECC_T0_OFF (0)

/** \\brief  Length for Ifx_EMEM_TILECC_Bits.T10 */
#define IFX_EMEM_TILECC_T10_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECC_Bits.T10 */
#define IFX_EMEM_TILECC_T10_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECC_Bits.T10 */
#define IFX_EMEM_TILECC_T10_OFF (10)

/** \\brief  Length for Ifx_EMEM_TILECC_Bits.T11 */
#define IFX_EMEM_TILECC_T11_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECC_Bits.T11 */
#define IFX_EMEM_TILECC_T11_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECC_Bits.T11 */
#define IFX_EMEM_TILECC_T11_OFF (11)

/** \\brief  Length for Ifx_EMEM_TILECC_Bits.T12 */
#define IFX_EMEM_TILECC_T12_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECC_Bits.T12 */
#define IFX_EMEM_TILECC_T12_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECC_Bits.T12 */
#define IFX_EMEM_TILECC_T12_OFF (12)

/** \\brief  Length for Ifx_EMEM_TILECC_Bits.T13 */
#define IFX_EMEM_TILECC_T13_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECC_Bits.T13 */
#define IFX_EMEM_TILECC_T13_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECC_Bits.T13 */
#define IFX_EMEM_TILECC_T13_OFF (13)

/** \\brief  Length for Ifx_EMEM_TILECC_Bits.T14 */
#define IFX_EMEM_TILECC_T14_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECC_Bits.T14 */
#define IFX_EMEM_TILECC_T14_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECC_Bits.T14 */
#define IFX_EMEM_TILECC_T14_OFF (14)

/** \\brief  Length for Ifx_EMEM_TILECC_Bits.T15 */
#define IFX_EMEM_TILECC_T15_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECC_Bits.T15 */
#define IFX_EMEM_TILECC_T15_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECC_Bits.T15 */
#define IFX_EMEM_TILECC_T15_OFF (15)

/** \\brief  Length for Ifx_EMEM_TILECC_Bits.T1 */
#define IFX_EMEM_TILECC_T1_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECC_Bits.T1 */
#define IFX_EMEM_TILECC_T1_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECC_Bits.T1 */
#define IFX_EMEM_TILECC_T1_OFF (1)

/** \\brief  Length for Ifx_EMEM_TILECC_Bits.T2 */
#define IFX_EMEM_TILECC_T2_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECC_Bits.T2 */
#define IFX_EMEM_TILECC_T2_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECC_Bits.T2 */
#define IFX_EMEM_TILECC_T2_OFF (2)

/** \\brief  Length for Ifx_EMEM_TILECC_Bits.T3 */
#define IFX_EMEM_TILECC_T3_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECC_Bits.T3 */
#define IFX_EMEM_TILECC_T3_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECC_Bits.T3 */
#define IFX_EMEM_TILECC_T3_OFF (3)

/** \\brief  Length for Ifx_EMEM_TILECC_Bits.T4 */
#define IFX_EMEM_TILECC_T4_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECC_Bits.T4 */
#define IFX_EMEM_TILECC_T4_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECC_Bits.T4 */
#define IFX_EMEM_TILECC_T4_OFF (4)

/** \\brief  Length for Ifx_EMEM_TILECC_Bits.T5 */
#define IFX_EMEM_TILECC_T5_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECC_Bits.T5 */
#define IFX_EMEM_TILECC_T5_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECC_Bits.T5 */
#define IFX_EMEM_TILECC_T5_OFF (5)

/** \\brief  Length for Ifx_EMEM_TILECC_Bits.T6 */
#define IFX_EMEM_TILECC_T6_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECC_Bits.T6 */
#define IFX_EMEM_TILECC_T6_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECC_Bits.T6 */
#define IFX_EMEM_TILECC_T6_OFF (6)

/** \\brief  Length for Ifx_EMEM_TILECC_Bits.T7 */
#define IFX_EMEM_TILECC_T7_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECC_Bits.T7 */
#define IFX_EMEM_TILECC_T7_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECC_Bits.T7 */
#define IFX_EMEM_TILECC_T7_OFF (7)

/** \\brief  Length for Ifx_EMEM_TILECC_Bits.T8 */
#define IFX_EMEM_TILECC_T8_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECC_Bits.T8 */
#define IFX_EMEM_TILECC_T8_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECC_Bits.T8 */
#define IFX_EMEM_TILECC_T8_OFF (8)

/** \\brief  Length for Ifx_EMEM_TILECC_Bits.T9 */
#define IFX_EMEM_TILECC_T9_LEN (1)

