HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEmem_bf.h
/** \\brief  Mask for Ifx_EMEM_TILECC_Bits.T9 */
#define IFX_EMEM_TILECC_T9_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECC_Bits.T9 */
#define IFX_EMEM_TILECC_T9_OFF (9)

/** \\brief  Length for Ifx_EMEM_TILECONFIG_Bits.T0 */
#define IFX_EMEM_TILECONFIG_T0_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILECONFIG_Bits.T0 */
#define IFX_EMEM_TILECONFIG_T0_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILECONFIG_Bits.T0 */
#define IFX_EMEM_TILECONFIG_T0_OFF (0)

/** \\brief  Length for Ifx_EMEM_TILECONFIG_Bits.T10 */
#define IFX_EMEM_TILECONFIG_T10_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILECONFIG_Bits.T10 */
#define IFX_EMEM_TILECONFIG_T10_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILECONFIG_Bits.T10 */
#define IFX_EMEM_TILECONFIG_T10_OFF (20)

/** \\brief  Length for Ifx_EMEM_TILECONFIG_Bits.T11 */
#define IFX_EMEM_TILECONFIG_T11_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILECONFIG_Bits.T11 */
#define IFX_EMEM_TILECONFIG_T11_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILECONFIG_Bits.T11 */
#define IFX_EMEM_TILECONFIG_T11_OFF (22)

/** \\brief  Length for Ifx_EMEM_TILECONFIG_Bits.T12 */
#define IFX_EMEM_TILECONFIG_T12_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILECONFIG_Bits.T12 */
#define IFX_EMEM_TILECONFIG_T12_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILECONFIG_Bits.T12 */
#define IFX_EMEM_TILECONFIG_T12_OFF (24)

/** \\brief  Length for Ifx_EMEM_TILECONFIG_Bits.T13 */
#define IFX_EMEM_TILECONFIG_T13_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILECONFIG_Bits.T13 */
#define IFX_EMEM_TILECONFIG_T13_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILECONFIG_Bits.T13 */
#define IFX_EMEM_TILECONFIG_T13_OFF (26)

/** \\brief  Length for Ifx_EMEM_TILECONFIG_Bits.T14 */
#define IFX_EMEM_TILECONFIG_T14_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILECONFIG_Bits.T14 */
#define IFX_EMEM_TILECONFIG_T14_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILECONFIG_Bits.T14 */
#define IFX_EMEM_TILECONFIG_T14_OFF (28)

/** \\brief  Length for Ifx_EMEM_TILECONFIG_Bits.T15 */
#define IFX_EMEM_TILECONFIG_T15_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILECONFIG_Bits.T15 */
#define IFX_EMEM_TILECONFIG_T15_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILECONFIG_Bits.T15 */
#define IFX_EMEM_TILECONFIG_T15_OFF (30)

/** \\brief  Length for Ifx_EMEM_TILECONFIG_Bits.T1 */
#define IFX_EMEM_TILECONFIG_T1_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILECONFIG_Bits.T1 */
#define IFX_EMEM_TILECONFIG_T1_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILECONFIG_Bits.T1 */
#define IFX_EMEM_TILECONFIG_T1_OFF (2)

/** \\brief  Length for Ifx_EMEM_TILECONFIG_Bits.T2 */
#define IFX_EMEM_TILECONFIG_T2_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILECONFIG_Bits.T2 */
#define IFX_EMEM_TILECONFIG_T2_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILECONFIG_Bits.T2 */
#define IFX_EMEM_TILECONFIG_T2_OFF (4)

/** \\brief  Length for Ifx_EMEM_TILECONFIG_Bits.T3 */
#define IFX_EMEM_TILECONFIG_T3_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILECONFIG_Bits.T3 */
#define IFX_EMEM_TILECONFIG_T3_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILECONFIG_Bits.T3 */
#define IFX_EMEM_TILECONFIG_T3_OFF (6)

/** \\brief  Length for Ifx_EMEM_TILECONFIG_Bits.T4 */
#define IFX_EMEM_TILECONFIG_T4_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILECONFIG_Bits.T4 */
#define IFX_EMEM_TILECONFIG_T4_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILECONFIG_Bits.T4 */
#define IFX_EMEM_TILECONFIG_T4_OFF (8)

/** \\brief  Length for Ifx_EMEM_TILECONFIG_Bits.T5 */
#define IFX_EMEM_TILECONFIG_T5_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILECONFIG_Bits.T5 */
#define IFX_EMEM_TILECONFIG_T5_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILECONFIG_Bits.T5 */
#define IFX_EMEM_TILECONFIG_T5_OFF (10)

/** \\brief  Length for Ifx_EMEM_TILECONFIG_Bits.T6 */
#define IFX_EMEM_TILECONFIG_T6_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILECONFIG_Bits.T6 */
#define IFX_EMEM_TILECONFIG_T6_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILECONFIG_Bits.T6 */
#define IFX_EMEM_TILECONFIG_T6_OFF (12)

/** \\brief  Length for Ifx_EMEM_TILECONFIG_Bits.T7 */
#define IFX_EMEM_TILECONFIG_T7_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILECONFIG_Bits.T7 */
#define IFX_EMEM_TILECONFIG_T7_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILECONFIG_Bits.T7 */
#define IFX_EMEM_TILECONFIG_T7_OFF (14)

/** \\brief  Length for Ifx_EMEM_TILECONFIG_Bits.T8 */
#define IFX_EMEM_TILECONFIG_T8_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILECONFIG_Bits.T8 */
#define IFX_EMEM_TILECONFIG_T8_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILECONFIG_Bits.T8 */
#define IFX_EMEM_TILECONFIG_T8_OFF (16)

/** \\brief  Length for Ifx_EMEM_TILECONFIG_Bits.T9 */
#define IFX_EMEM_TILECONFIG_T9_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILECONFIG_Bits.T9 */
#define IFX_EMEM_TILECONFIG_T9_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILECONFIG_Bits.T9 */
#define IFX_EMEM_TILECONFIG_T9_OFF (18)

/** \\brief  Length for Ifx_EMEM_TILECT_Bits.T0 */
#define IFX_EMEM_TILECT_T0_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECT_Bits.T0 */
#define IFX_EMEM_TILECT_T0_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECT_Bits.T0 */
#define IFX_EMEM_TILECT_T0_OFF (0)

/** \\brief  Length for Ifx_EMEM_TILECT_Bits.T10 */
#define IFX_EMEM_TILECT_T10_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECT_Bits.T10 */
#define IFX_EMEM_TILECT_T10_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECT_Bits.T10 */
#define IFX_EMEM_TILECT_T10_OFF (10)

/** \\brief  Length for Ifx_EMEM_TILECT_Bits.T11 */
#define IFX_EMEM_TILECT_T11_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECT_Bits.T11 */
#define IFX_EMEM_TILECT_T11_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECT_Bits.T11 */
#define IFX_EMEM_TILECT_T11_OFF (11)

/** \\brief  Length for Ifx_EMEM_TILECT_Bits.T12 */
#define IFX_EMEM_TILECT_T12_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECT_Bits.T12 */
#define IFX_EMEM_TILECT_T12_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECT_Bits.T12 */
#define IFX_EMEM_TILECT_T12_OFF (12)

/** \\brief  Length for Ifx_EMEM_TILECT_Bits.T13 */
#define IFX_EMEM_TILECT_T13_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECT_Bits.T13 */
#define IFX_EMEM_TILECT_T13_MSK (0x1)

