HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEmem_bf.h
/** \\brief  Offset for Ifx_EMEM_TILECT_Bits.T13 */
#define IFX_EMEM_TILECT_T13_OFF (13)

/** \\brief  Length for Ifx_EMEM_TILECT_Bits.T14 */
#define IFX_EMEM_TILECT_T14_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECT_Bits.T14 */
#define IFX_EMEM_TILECT_T14_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECT_Bits.T14 */
#define IFX_EMEM_TILECT_T14_OFF (14)

/** \\brief  Length for Ifx_EMEM_TILECT_Bits.T15 */
#define IFX_EMEM_TILECT_T15_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECT_Bits.T15 */
#define IFX_EMEM_TILECT_T15_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECT_Bits.T15 */
#define IFX_EMEM_TILECT_T15_OFF (15)

/** \\brief  Length for Ifx_EMEM_TILECT_Bits.T1 */
#define IFX_EMEM_TILECT_T1_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECT_Bits.T1 */
#define IFX_EMEM_TILECT_T1_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECT_Bits.T1 */
#define IFX_EMEM_TILECT_T1_OFF (1)

/** \\brief  Length for Ifx_EMEM_TILECT_Bits.T2 */
#define IFX_EMEM_TILECT_T2_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECT_Bits.T2 */
#define IFX_EMEM_TILECT_T2_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECT_Bits.T2 */
#define IFX_EMEM_TILECT_T2_OFF (2)

/** \\brief  Length for Ifx_EMEM_TILECT_Bits.T3 */
#define IFX_EMEM_TILECT_T3_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECT_Bits.T3 */
#define IFX_EMEM_TILECT_T3_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECT_Bits.T3 */
#define IFX_EMEM_TILECT_T3_OFF (3)

/** \\brief  Length for Ifx_EMEM_TILECT_Bits.T4 */
#define IFX_EMEM_TILECT_T4_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECT_Bits.T4 */
#define IFX_EMEM_TILECT_T4_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECT_Bits.T4 */
#define IFX_EMEM_TILECT_T4_OFF (4)

/** \\brief  Length for Ifx_EMEM_TILECT_Bits.T5 */
#define IFX_EMEM_TILECT_T5_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECT_Bits.T5 */
#define IFX_EMEM_TILECT_T5_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECT_Bits.T5 */
#define IFX_EMEM_TILECT_T5_OFF (5)

/** \\brief  Length for Ifx_EMEM_TILECT_Bits.T6 */
#define IFX_EMEM_TILECT_T6_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECT_Bits.T6 */
#define IFX_EMEM_TILECT_T6_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECT_Bits.T6 */
#define IFX_EMEM_TILECT_T6_OFF (6)

/** \\brief  Length for Ifx_EMEM_TILECT_Bits.T7 */
#define IFX_EMEM_TILECT_T7_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECT_Bits.T7 */
#define IFX_EMEM_TILECT_T7_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECT_Bits.T7 */
#define IFX_EMEM_TILECT_T7_OFF (7)

/** \\brief  Length for Ifx_EMEM_TILECT_Bits.T8 */
#define IFX_EMEM_TILECT_T8_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECT_Bits.T8 */
#define IFX_EMEM_TILECT_T8_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECT_Bits.T8 */
#define IFX_EMEM_TILECT_T8_OFF (8)

/** \\brief  Length for Ifx_EMEM_TILECT_Bits.T9 */
#define IFX_EMEM_TILECT_T9_LEN (1)

/** \\brief  Mask for Ifx_EMEM_TILECT_Bits.T9 */
#define IFX_EMEM_TILECT_T9_MSK (0x1)

/** \\brief  Offset for Ifx_EMEM_TILECT_Bits.T9 */
#define IFX_EMEM_TILECT_T9_OFF (9)

/** \\brief  Length for Ifx_EMEM_TILESTATE_Bits.TILE0 */
#define IFX_EMEM_TILESTATE_TILE0_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILESTATE_Bits.TILE0 */
#define IFX_EMEM_TILESTATE_TILE0_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILESTATE_Bits.TILE0 */
#define IFX_EMEM_TILESTATE_TILE0_OFF (0)

/** \\brief  Length for Ifx_EMEM_TILESTATE_Bits.TILE10 */
#define IFX_EMEM_TILESTATE_TILE10_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILESTATE_Bits.TILE10 */
#define IFX_EMEM_TILESTATE_TILE10_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILESTATE_Bits.TILE10 */
#define IFX_EMEM_TILESTATE_TILE10_OFF (20)

/** \\brief  Length for Ifx_EMEM_TILESTATE_Bits.TILE11 */
#define IFX_EMEM_TILESTATE_TILE11_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILESTATE_Bits.TILE11 */
#define IFX_EMEM_TILESTATE_TILE11_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILESTATE_Bits.TILE11 */
#define IFX_EMEM_TILESTATE_TILE11_OFF (22)

/** \\brief  Length for Ifx_EMEM_TILESTATE_Bits.TILE12 */
#define IFX_EMEM_TILESTATE_TILE12_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILESTATE_Bits.TILE12 */
#define IFX_EMEM_TILESTATE_TILE12_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILESTATE_Bits.TILE12 */
#define IFX_EMEM_TILESTATE_TILE12_OFF (24)

/** \\brief  Length for Ifx_EMEM_TILESTATE_Bits.TILE13 */
#define IFX_EMEM_TILESTATE_TILE13_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILESTATE_Bits.TILE13 */
#define IFX_EMEM_TILESTATE_TILE13_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILESTATE_Bits.TILE13 */
#define IFX_EMEM_TILESTATE_TILE13_OFF (26)

/** \\brief  Length for Ifx_EMEM_TILESTATE_Bits.TILE14 */
#define IFX_EMEM_TILESTATE_TILE14_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILESTATE_Bits.TILE14 */
#define IFX_EMEM_TILESTATE_TILE14_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILESTATE_Bits.TILE14 */
#define IFX_EMEM_TILESTATE_TILE14_OFF (28)

/** \\brief  Length for Ifx_EMEM_TILESTATE_Bits.TILE15 */
#define IFX_EMEM_TILESTATE_TILE15_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILESTATE_Bits.TILE15 */
#define IFX_EMEM_TILESTATE_TILE15_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILESTATE_Bits.TILE15 */
#define IFX_EMEM_TILESTATE_TILE15_OFF (30)

/** \\brief  Length for Ifx_EMEM_TILESTATE_Bits.TILE1 */
#define IFX_EMEM_TILESTATE_TILE1_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILESTATE_Bits.TILE1 */
#define IFX_EMEM_TILESTATE_TILE1_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILESTATE_Bits.TILE1 */
#define IFX_EMEM_TILESTATE_TILE1_OFF (2)

/** \\brief  Length for Ifx_EMEM_TILESTATE_Bits.TILE2 */
#define IFX_EMEM_TILESTATE_TILE2_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILESTATE_Bits.TILE2 */
#define IFX_EMEM_TILESTATE_TILE2_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILESTATE_Bits.TILE2 */
#define IFX_EMEM_TILESTATE_TILE2_OFF (4)

/** \\brief  Length for Ifx_EMEM_TILESTATE_Bits.TILE3 */
#define IFX_EMEM_TILESTATE_TILE3_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILESTATE_Bits.TILE3 */
#define IFX_EMEM_TILESTATE_TILE3_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILESTATE_Bits.TILE3 */
#define IFX_EMEM_TILESTATE_TILE3_OFF (6)

/** \\brief  Length for Ifx_EMEM_TILESTATE_Bits.TILE4 */
#define IFX_EMEM_TILESTATE_TILE4_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILESTATE_Bits.TILE4 */
#define IFX_EMEM_TILESTATE_TILE4_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILESTATE_Bits.TILE4 */
#define IFX_EMEM_TILESTATE_TILE4_OFF (8)

/** \\brief  Length for Ifx_EMEM_TILESTATE_Bits.TILE5 */
#define IFX_EMEM_TILESTATE_TILE5_LEN (2)

