HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEmem_bf.h
/** \\brief  Mask for Ifx_EMEM_TILESTATE_Bits.TILE5 */
#define IFX_EMEM_TILESTATE_TILE5_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILESTATE_Bits.TILE5 */
#define IFX_EMEM_TILESTATE_TILE5_OFF (10)

/** \\brief  Length for Ifx_EMEM_TILESTATE_Bits.TILE6 */
#define IFX_EMEM_TILESTATE_TILE6_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILESTATE_Bits.TILE6 */
#define IFX_EMEM_TILESTATE_TILE6_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILESTATE_Bits.TILE6 */
#define IFX_EMEM_TILESTATE_TILE6_OFF (12)

/** \\brief  Length for Ifx_EMEM_TILESTATE_Bits.TILE7 */
#define IFX_EMEM_TILESTATE_TILE7_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILESTATE_Bits.TILE7 */
#define IFX_EMEM_TILESTATE_TILE7_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILESTATE_Bits.TILE7 */
#define IFX_EMEM_TILESTATE_TILE7_OFF (14)

/** \\brief  Length for Ifx_EMEM_TILESTATE_Bits.TILE8 */
#define IFX_EMEM_TILESTATE_TILE8_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILESTATE_Bits.TILE8 */
#define IFX_EMEM_TILESTATE_TILE8_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILESTATE_Bits.TILE8 */
#define IFX_EMEM_TILESTATE_TILE8_OFF (16)

/** \\brief  Length for Ifx_EMEM_TILESTATE_Bits.TILE9 */
#define IFX_EMEM_TILESTATE_TILE9_LEN (2)

/** \\brief  Mask for Ifx_EMEM_TILESTATE_Bits.TILE9 */
#define IFX_EMEM_TILESTATE_TILE9_MSK (0x3)

/** \\brief  Offset for Ifx_EMEM_TILESTATE_Bits.TILE9 */
#define IFX_EMEM_TILESTATE_TILE9_OFF (18)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXEMEM_BF_H */
